---
title: 私钥被盗，我该怎么办
date: 2021-04-22 15:01:14
tags: 
---

事前说明，本文只针对不熟练的密钥偷盗者，对于熟练的，直接往 Tornado 之类 Mixer 一发就会光速去世。

## 及时止损

1. 如果偷盗者给你的钱包留下了 ERC20 等代币，不要试图取回它，这是*不*可能的，你所转入的任何 gas 费用都会被攻击者转走，当然，也有可能是忘记转走，建议尝试一次，如果失败了不要再做出任何尝试。  
2. 如果你的钱包在其他链上有有价资产，立即转走他们，攻击者可能只关注一条区块链上的行为。
3. 对于第一步，MEV 交易在大部分情况下都是不合算的，如果合算，你可以尝试一下。
4. 有些人会尝试使用合约自毁向钱包内转入 gas 费用，但这不一定能起效，因为收割者可能会侦听余额而不是交易事件。

## 开始追踪代币交易，并向交易所等报告

首先，你应该向 Etherscan 报告代币被盗，这样可以阻止大部分交易平台接受交易。  
如果代币已经进入交易所，尽快报警！要求交易所协助冻结数字货币，有时候这样做可能会比第一条好，因为可能可以追回几乎全部损失，但是要快！

## 那些安全公司有用么

就像汉佛莱说的一样，有，也没有。  
所谓的代币追回基本上是靠交易所的关系做到的，他们利用一些私下的关系处理这种事会更快，但是他们并不能对链上发生的任何事做干涉，他们能做的和我们上面所说的基本一致。

## 一些其他提示

尽管市面上大部分硬件钱包都有点安全缺陷，但他们确实多多少少有一点安全性提升的作用，如果你持有代币数量够多，还是买一个为好。  
另外，手机上执行交易相对来说还是更安全的，因为桌面操作系统很多情况下都是等于无防护的。


